Repository: oe-alliance/XMLTV-Import
Catalog: src/EPGImport/locale/*.po
Languages: el, fi, it

source: Add Provider
el: Προσθήκη παρόχου
fi: Lisää Palveluntarjoaja
it: Aggiungi provider

source: Add Channel
el: Προσθήκη Καναλιού
fi: Lisää Kanava
it: Aggiungi canale

source: press OK to save list
it: premi OK per salvare la lista

source: Ignore services list
el: Αγνόηση λίστας υπηρεσιών
fi: Ohita palvelu lista
it: Ignora l'elenco canali

source: Really delete all list?
el: Σίγουρα να διαγραφούν όλες οι λίστες;
fi: Haluatko varmasti poistaa kaikki listat?
it: Sicuro di eliminare tutta la lista?

source: Delete selected
el: Διαγραφή επιλεγμένου
fi: Poista valittu
it: Rimuovi selezionato

source: Delete all
el: Διαγραφή όλων
fi: Poista kaikki
it: Cancella tutto

source: Select service to add...
it: Seleziona il canale da aggiungere...

source: All services provider
el: Πάροχος όλων των υπηρεσιών
fi: Kaikki palveluntarjoajat
it: Tutti i canali di ogni provider

source: Select action
el: Επιλογή ενέργειας
fi: Valitse toiminto
it: Selezionare azione

source: always
el: πάντα
fi: aina
it: sempre

source: only manual boot
el: μόνο χειροκίνητη εκκίνηση
fi: vain manuaalisessa uudelleenkäynnistyksessä
it: solo avvio manuale

source: only automatic boot
el: μόνο αυτόματη εκκίνηση
fi: vain automaattisessa uudelleenkäynnistyksessä
it: solo avvio automatico

source: never
el: ποτέ
fi: ei koskaan
it: mai

source: wake up and import
el: αφύπνιση και εισαγωγή
fi: herätä ja lataa
it: sveglia e importa

source: skip the import
el: παράκαμψη εισαγωγής
fi: ohita lataus
it: salta l'importazione

source: Press OK
el: Πιέστε ΟΚ
fi: Paina OK
it: Premere OK

source: Monday
el: Δευτέρα
fi: Maanantai
it: Lunedì

source: Tuesday
el: Τρίτη
fi: Tiistai
it: Martedì

source: Wednesday
el: Τετάρτη
fi: Keskiviikko
it: Mercoledì

source: Thursday
el: Πέμπτη
fi: Torstai
it: Giovedì

source: Friday
el: Παρασκευή
fi: Perjantai
it: Venerdì

source: Saturday
el: Σάββατο
fi: Lauantai
it: Sabato

source: Sunday
el: Κυριακή
fi: Sunnuntai
it: Domenica

source: EPG Import Configuration
el: Ρυθμίσεις Εισαγωγής EPG
fi: Asetukset
it: Configurazione di EPG Import

source: Last import: %s events
el: Τελευταία εισαγωγή: %s προγράμματα
fi: Viimeisin lataus: %s tapahtumaa
it: Ultima importazione: %s canali

source: Cancel
el: Ακύρωση
fi: Poistu
it: Annulla

source: Save
el: Αποθήκευση
fi: Tallenna
it: Salva

source: Manual
el: Χειροκίνητα
fi: Lataa nyt
it: Scarica

source: Sources
el: Πηγές
fi: Lähteet
it: Sorgenti

source: Filtering: %s Please wait!
it: Filtraggio: %s Attendi!

source: Importing: %s %s events
it: Importazione: %s %s eventi

source: Automatic import EPG
el: Αυτόματη εισαγωγή EPG
fi: Automaattinen EPG lataus
it: Importazione EPG automatica

source: When enabled, it allows you to schedule an automatic EPG update at the given days and time.
fi: Kun tämä asetus on käytössä, sen avulla voit ajoittaa automaattisen EPG päivityksen tiettyinä päivinä ja kellonaikana.
it: Se abilitata, consente di programmare un aggiornamento automatico dell'EPG nei giorni e negli orari indicati.

source: Automatic start time
el: Αυτόματη ώρα έναρξης
fi: Aloitusaika
it: Orario di avvio automatico

source: Specify the time for the automatic EPG update.
fi: Määritä automaattisen EPG päivityksen aika.
it: Specificare l'ora per l'aggiornamento automatico dell'EPG.

source: When in deep standby
el: Σε βαθιά αναμονή
fi: Virransäästötilassa lataus
it: Quando il box è spento

source: Choose the action to perform when the box is in deep standby and the automatic EPG update should normally start.
fi: Valitse suoritettava toiminto, kun vastaanotin on virransäästötilassa ja automaattisen EPG-päivityksen pitäisi normaalisti käynnistyä.
it: Selezionare l'azione da eseguire quando il box è in modalità standby profondo; normalmente, l'aggiornamento automatico dell'EPG dovrebbe avviarsi.

source: Return to deep standby after import
el: Επιστροφή σε βαθιά αναμονή μετά την εισαγωγή
fi: Palaa virransäästötilaan latauksen jälkeen
it: Spegni di nuovo dopo l'importazione

source: This will turn back waked up box into deep-standby after automatic EPG import.
fi: Käynnistynyt vastaanotin palaa virransäästö tilaan takaisin, automaattisen EPG latauksen jälkeen.
it: Ciò riporterà il box riattivato in modalità deep standby dopo l'importazione automatica dell'EPG.

source: Standby at startup
el: Αναμονή κατά την εκκίνηση
fi: Valmiustilassa lataus
it: Standby all'avvio

source: The waked up box will be turned into standby after automatic EPG import wake up.
fi: Käynnistynyt vastaanotin palaa valmiustilaan, automaattisen EPG latauksen jälkeen.
it: Il box riattivato passerà in modalità standby dopo la riattivazione tramite importazione automatica EPG.

source: Choice days for start import
el: Επιλογή ημερών για εκκίνηση εισαγωγής
fi: Valitse latauspäivät
it: Seleziona il giorno di avvio importazione

source: You can select the day(s) when the EPG update must be performed.
fi: Voit valita päivät , jolloin EPG päivitys on suoritettaan.
it: È possibile selezionare il/i giorno/i in cui deve essere eseguito l'aggiornamento EPG.

source: Start import after booting up
el: Έναρξη εισαγωγής μετά την εκκίνηση
fi: Lataa uudelleenkäynnistyksen jälkeen
it: Avvia l'importazione dopo il boot

source: Specify in which case the EPG must be automatically updated after the box has booted.
fi: Määritä, missä tapauksessa EPG on päivitettävä automaattisesti vastaanottimen käynnistymisen jälkeen.
it: Specifica in quale caso l'EPG deve essere aggiornato automaticamente dopo l'avvio del box.

source: Load EPG only services in bouquets
el: Φόρτωση μόνο υπηρεσιών με EPG στα μπουκέτα
fi: Lataa EPG vain suosikkilistojen kanaville
it: Carica solo i servizi EPG nei bouquet

source: To save memory you can decide to only load EPG data for the services that you have in your bouquet files.
fi: Muistin säästämiseksi voit päättää ladata EPG tiedot vain valituista palveluista.
it: Per risparmiare memoria puoi decidere di caricare solo i dati EPG dei servizi presenti nei tuoi file bouquet.

source: Load EPG only for IPTV channels
fi: Lataa EPG vain iptv kanaville
it: Carica gli EPG solo per i canali IPTV

source: Specify in this case the EPG should be imported only for iptv lists.
it: Specificare che in questo caso l'EPG deve essere importato solo per le liste IPTV.

source: Consider setting "Days Profile"
el: Θυμηθείτε να ορίσετε το "Προφίλ Ημερών"
fi: Harkitse asetusta "Valitse päivät"
it: Considera l'impostazione "Profilo giorni"

source: When you decide to import the EPG after the box booted mention if the "days profile" must be take into consideration or not.
it: Quando si decide di importare l'EPG dopo l'avvio del box, specificare se il "profilo giorni" deve essere preso in considerazione o meno.

source: Skip import on restart GUI
el: Παράκαμψη εισαγωγής κατά την επανεκκίνηση του GUI
fi: Ohita lataus uudelleenkäynnistyksessä
it: Salta importazione su riavvio sistema

source: When you restart the GUI you can decide to skip or not the EPG data import.
fi: Kun käynnistät käyttöliittymän uudelleen, voit jättää EPG tietojen tuonnin ohittamatta.
it: Quando si riavvia l'interfaccia grafica è possibile decidere se saltare o meno l'importazione dei dati EPG.

source: Show "EPG import now" in extensions
it: Mostra "EPGImport ora" nelle estensioni

source: Display a shortcut "EPG import now" in the extension menu. This menu entry will immediately start the EPG update process when selected.
it: Visualizza una scorciatoia "EPG import now" nel menu estensione. Questa voce di menu avvierà immediatamente il processo di aggiornamento EPG quando selezionata.

source: Show "EPGImport" in plugins
fi: Näytä "EPG:n lataus" lisäosissa
it: Mostra "EPGImport" nei plugins

source: Display a shortcut "EPG import" in the browser plugin..
it: Visualizza una scorciatoia "Importazione EPG" nel plugin del browser.

source: Load long descriptions up to X days
el: Φόρτωση εκτεταμένων περιγραφών έως και Χ ημέρες
fi: Lataa ohjelmakuvaukset päivälle
it: Carica le descrizioni dettagliate fino a (n) giorni

source: Define the number of days that you want to get the full EPG data, reducing this number can help you to save memory usage on your box. But you are also limited with the EPG provider available data. You will not have 15 days EPG if it only provide 7 days data.
fi: Määritä päivien lukumäärä, jolloin haluat saada täydelliset EPG-tiedot, tämän numeron pienentäminen voi auttaa sinua säästämään vastaanottimesi muistisi. Mutta sinulla on rajoituksia EPG käytettävissä oleviin tietoihin. Sinulla ei ole 15 päivän EPG:tä, jos se antaa vain 7 päivän tiedot.
it: Definisci il numero di giorni in cui vuoi ottenere i dati EPG completi, ridurre questo numero può aiutarti a risparmiare memoria sul tuo box. Ma sei anche limitato dai dati disponibili del provider EPG. Non avrai 15 giorni di EPG se fornisce solo 7 giorni di dati.

source: Run AutoTimer after import
el: Εκτέλεση Αυτόματου Χρονοδιακόπτη μετά την εισαγωγή
fi: Käynnistä automaattiajastukset haku EPG:en latauksen jälkeen
it: Avvia AutoTimer dopo l'aggiornamento

source: You can start automatically the plugin AutoTimer after the EPG data update to have it refreshing its scheduling after EPG data refresh.
fi: Voit käynnistää Automaattiset ajastukset laajennuksen automaattisesti EPG-tietojen päivityksen jälkeen, jotta se päivittää ajoituksensa EPG tietojen päivityksen jälkeen.
it: È possibile avviare automaticamente il plugin AutoTimer dopo l'aggiornamento dei dati EPG, in modo che aggiorni la sua programmazione dopo l'aggiornamento dei dati EPG.

source: Clearing current EPG before import
el: Καθαρισμός τρέχοντος EPG πριν την εισαγωγή
fi: Tyhjennä nykyinen EPG ennen latausta
it: Cancella EPG corrente prima dell’importazione

source: This will clear the current EPG data in memory before updating the EPG data. This allows you to always have a clean new EPG with the latest EPG data, for example in case of program changes between refresh, otherwise EPG data are cumulative.
fi: Tämä tyhjentää nykyiset EPG tiedot muistista ennen EPG-tietojen päivittämistä. Tämä antaa sinulle aina uuden puhtaan EPG: n, joka sisältää uusimmat EPG-tiedot, esimerkiksi jos päivitysvaiheessa tapahtuu ohjelmamuutoksia, muuten EPG-tiedot ovat kumulatiivisia.
it: Questo cancellerà i dati EPG correnti in memoria prima di aggiornare i dati EPG. Questo ti consente di avere sempre un nuovo EPG pulito con i dati EPG più recenti, ad esempio in caso di modifiche al programma tra un aggiornamento e l'altro, altrimenti i dati EPG sono cumulativi.

source: Also apply "channel id" filtering on custom.channels.xml
fi: Käytä myös suodatusta `kanava id` suodatinta custom.channels.xml
it: Applicare anche il filtro "ID canale" su custom.channels.xml

source: This is for advanced users that are using the channel id filtering feature. If enabled, the filter rules defined into /etc/epgimport/channel_id_filter.conf will also be applied on your /etc/epgimport/custom.channels.xml file.
fi: Tämä on edistyneille käyttäjille, jotka käyttävät kanavan id:een suodatus ominaisuutta. Jos on käytössä, suodatinsäännöt määritellään /etc/epgimport/channel_id_filter.conf soveltaa myös /etc/epgimport/custom.channels.xml tiedosto.
it: Questo è per gli utenti avanzati che utilizzano la funzionalità di filtraggio dell'ID canale. Se abilitata, le regole di filtro definite in /etc/epgimport/channel_id_filter.conf saranno applicate anche al file /etc/epgimport/custom.channels.xml.

source: Execute shell command before import EPG
it: Eseguire il comando shell prima di importare EPG

source: When enabled, then you can run the desired script before starting the import, after which the import of the EPG will begin.
it: Se abilitata, è possibile eseguire lo script desiderato prima di avviare l'importazione, dopodiché avrà inizio l'importazione dell'EPG.

source: Shell command name
it: Nome Comando Shell

source: Enter shell command name.
it: Inserisci il nome del comando shell.

source: Start import after standby
it: Avvia l'importazione dopo lo standby

source: Start import after resuming from standby mode.
it: Avvia l'importazione dopo la ripresa dalla modalità standby.

source: Hours after which the import is repeated
it: Ore dopo le quali l'importazione viene ripetuta

source: Number of hours (1-23, or 0 for no repeat) after which the import is repeated. This value is not saved and will be reset when the GUI restarts.
it: Numero di ore (1-23, o 0 per nessuna ripetizione) dopo le quali l'importazione viene ripetuta. Questo valore non viene salvato e verrà reimpostato al riavvio della GUI.

source: Settings saved successfully !
it: Impostazioni salvate con successo!

source: Last: %s %s, %d events
el: Τελευταίο: %s %s, %d προγράμματα
fi: Ladattu: %s %s, %d tapahtumaa
it: Ultima importazione: %s %s, %d canali

source: EPGImport Import of epg data is still in progress. Please wait.
el: Εισαγωγή EPG Η εισαγωγή των δεδομένων EPG είναι ακόμα σε εξέλιξη. Περιμένετε...
fi: EPG:n lataus EPG:n lataus käynnissä. Odota.
it: EPG-Import Importazione dati EPG in corso... Attendere prego.

source: No active EPG sources found, nothing to do
el: Δεν βρέθηκαν ενεργές πηγές EPG, καμία ενέργεια
fi: Ei löytynyt aktiivisia EPG lähteitä
it: Fonti EPG attive non trovate: nessuna operazione svolta

source: EPGImport Import of epg data will start. This may take a few minutes. Is this ok?
el: Εισαγωγή EPG Θα ξεκινήσει η εισαγωγή των δεδομένων epg. Αυτό μπορεί να διαρκέσει μερικά λεπτά. Είναι αυτό εντάξει;
fi: EPG:n lataus EPG:n lataus alkaa. Tämä voi kestää muutaman minuutin. Onko tämä OK?
it: EPG-Import Eseguo importazione dati EPG. Questo processo potrebbe richiedere qualche minuto Procedo?

source: EPGImport Plugin Failed to start:
el: Πρόσθετο Εισαγωγής EPG Αδυναμία εκκίνησης:
fi: EPG lataus Käynnistys epäonnistui:
it: Plugin EPG-Import Avvio fallito:

source: Show log
el: Εμφάνιση καταγραφής
fi: Näytä loki
it: Mostra il log

source: Import
it: Importa

source: EPG Import Sources
el: Πηγές Εισαγωγής EPG
fi: Lähteet
it: Fonti importazione EPG

source: Days Profile
el: Προφίλ Ημερών
fi: Valitse päivät
it: Profilo dei giorni

source: You may not use this settings! At least one day a week should be included!
el: Μπορείτε να μη χρησιμοποιήσετε αυτές τις ρυθμίσεις! Πρέπει να συμπεριλαμβάνεται τουλάχιστον μία ημέρα της εβδομάδας!
fi: Et voi käyttää tätä asetusta! Vähintään yksi päivä pitää valita!
it: Non è possibile utilizzare queste impostazioni! Devi indicare almeno un giorno della settimana!

source: Clear
el: Καθαρισμός
fi: Tyhjennä
it: Cancella

source: EPG Import Log
el: Καταγραφή Εισαγωγής EPG
fi: Loki
it: Registro importazione EPG

source: Write to /tmp/epgimport.log
el: Εγγραφή στο /tmp/EPGimport.log
it: Scrittura in /tmp/epgimport.log

source: Last import:
el: Τελευταία εισαγωγή:
fi: Viimeisin lataus:
it: Ultima importazione:

source: events
el: προγράμματα
fi: tapahtumia
it: Eventi

source: Import of epg data will start. This may take a few minutes. Is this ok?
el: Θα ξεκινήσει η εισαγωγή των δεδομένων epg. Αυτό μπορεί να διαρκέσει μερικά λεπτά. Είναι αυτό εντάξει;
fi: EPG-tietojen lataus alkaa. Tämä voi kestää muutaman minuutin. Onko tämä OK?
it: Eseguo importazione dati EPG. Questo processo potrebbe richiedere qualche minuto Procedo?

source: EPG Import finished, %d events
el: Η εισαγωγή EPG ολοκληρώθηκε, %d προγράμματα
fi: Lataus valmis, %d tapahtumaa
it: Importazione EPG completata, %d eventi

source: You must restart Enigma2 to load the EPG data, is this OK?
el: Το Enigma2 πρέπει να επανεκκινηθεί για να φορτωθούν τα δεδομένα EPG, είναι αυτό εντάξει;
fi: Enigma2 on uudelleenkäynnistettävä, OK?
it: Richiesto il riavvio del sistema per caricare i dati EPG: Procedo?

source: No source file found !
it: Nessun file sorgente trovato!

source: Automated EPG Importer
el: Αυτοματοποιημένη Eισαγωγή EPG
fi: Automaattinen EPG:n lataus
it: Importazione EPG automatica

source: EPG import now
fi: Lataa nyt
it: Importa EPG ora

source: Channel Selection
el: Επιλογή Καναλιών
fi: Kanavien valinta

source: Display a shortcut "EPG import now" on your STB main screen. This menu entry will immediately start the EPG update process when selected.
fi: Näytä pikakuvake "EPG lataus nyt" vastaanottimen ruudussa. Tämä valikkokohta aloittaa EPG-päivitysprosessin heti, kun se valitaan.

source: Display or not the EPGImport menu in the extension menu.
fi: Näytä tai älä näytä EPG latausta lisäosat valikossa.

source: EPGImport
fi: EPG:n lataus

source: Filtering: %s Please wait!
fi: Suodattaa: %s Odota!

source: Ignore services list(press OK to save)
el: Αγνόηση λίστας υπηρεσιών (πιέστε ΟΚ για αποθήκευση)
fi: Ohita palvelu lista (paina OK tallentaaksesi)

source: Import current source
el: Εισαγωγή τρέχουσας πηγής
fi: Lataa tämä lähde

source: Importing: %s %s events
el: Εισαγωγή σε εξέλιξη: %s %s προγράμματα
fi: Lataa: %s %s events

source: Show "EPG import now" in main menu
fi: Näytä "EPG:n lataus" päävalikossa

source: Show "EPGImport" in extensions
el: Εμφάνιση της "Εισαγωγής EPG" στις επεκτάσεις
fi: Näytä "EPG:n lataus" laajennusvalikossa

source: When you decide to load the EPG after GUI restart mention if the "days profile" must be take into consideration or not.
fi: Kun päätät ladata EPG: n käyttöliittymän uudelleenkäynnistyksen jälkeen, mainitse, onko "päivät profiili" otettava huomioon vai ei.

source: EPG-Importer
el: Εισαγωγή-EPG
fi: EPG:n lataus

source: Show "EPG Importer" in main menu
el: Εμφάνιση της "Εισαγωγής EPG" στο κύριο μενού

source: EPG Importer
el: Εισαγωγή EPG
