Repository: oe-alliance/XMLTV-Import
Catalog: po/*.po
Languages: et, ru

source: Automated EPG Importer
ru: Автоматический импорт EPG

source: Automatic start time
et: Automaatse käivituse aeg
ru: Время автостарта

source: Cancel
et: Tühista
ru: Отмена

source: Clear
et: Kustuta
ru: Очистить

source: Daily automatic import
et: Automaatne EPG hankimine iga päev
ru: Ежедневный автоимпорт

source: EPG Import Configuration
ru: Конфигурация импорта EPG

source: EPG Import Log
ru: Журнал EPG импорта

source: EPG Import Sources
ru: Источники EPG импорта

source: EPG Import finished, %d events
ru: EPG импорт завершён, %d событий

source: EPGImport Plugin Failed to start:
ru: Не удалось запустить плагин EPG Import:

source: EPGImport Plugin Import of epg data is still in progress. Please wait.
ru: Плагин EPG Import Импорт данных EPG все еще продолжается. Пожалуйста, ждите.

source: EPGImport Plugin Import of epg data will start This may take a few minutes Is this ok?
ru: Плагин EPG Import Импорт данных EPG начинается Это может занять несколько минут Выполнить это сейчас?

source: Importing:
et: Hankimisel:
ru: Импортировано:

source: Last: %s %s, %d events
et: Viimane: %s %s, %d saadet
ru: Последние: %s %s, %d события

source: Load long descriptions up to X days
et: Pikk saatetutvustus X päevaks
ru: Загрузите длинные описания вплоть до X дней

source: Manual
et: Käsitsi
ru: Вручную

source: No active EPG sources found, nothing to do
et: EPG allikad on määramata. Midagi ei saa teha.
ru: Активных источников EPG не найдено, ничего не делаю

source: Ok
ru: ОК

source: Save
et: Salvesta
ru: Сохранить

source: Show in extensions
et: Näita laienduste menüüs (sinine nupp)
ru: Отобразить в списке расширений

source: Show in plugin browser
et: Näita laienduste lehitsejas
ru: Отобразить в списке плагинов

source: Skip the import
et: Ära hangi
ru: Пропустить импорт

source: Sources
et: Allikad
ru: Источники

source: Standby at startup
et: Käivitamisel ooterežiimi
ru: Режим ожидания при запуске

source: Start import after booting up
et: Hangi EPG pärast algkäivitust
ru: Запуск импорта после загрузки

source: Wake up and import
et: Käivita ja hangi epg
ru: Импорт после пробуждения

source: When in deep standby
et: Sügavooterežiimis
ru: В полном режиме ожидания

source: XMLTV-Importer
et: XMLTV import
ru: Импорт XMLTV

source: You must restart Enigma2 to load the EPG data, is this OK?
et: EPG laadimiseks tuleb Enigma2 taaskäivitada. Kas see sobib?
ru: Вы должны перезапустить Энигму для загрузки данных EPG, Выполнить это сейчас?

source: Automated XMLTV Importer
et: Automaatne EPG hankija

source: XMLTV Import Configuration
et: Seadistamine

source: XMLTV Import Log
et: EPG importija logi

source: XMLTV Import Sources
et: EPG importija allikad

source: XMLTV Import finished, %d events
et: EPG hankimine lõpetatud, %d saadet

source: XLMTVImport Plugin Failed to start:
et: XLMTVImport Käivitamine nurjus:

source: XLMTVImport Plugin Import of epg data is still in progress. Please wait.
et: XLMTVImport Epg hankimine on pooleli. Oota.

source: XLMTVImport Plugin Import of epg data will start This may take a few minutes Is this ok?
et: XLMTVImport Algab epg hankimine See võib kesta mõne minuti Kas see sobib?
